In [8]:
import pandas as pd
df = pd.read_excel("https://github.com/chris1610/pbpython/blob/master/data/sample-salesv3.xlsx?raw=True")

In [11]:
df.dtypes

account number             int64
name                      object
sku                       object
quantity                   int64
unit price               float64
ext price                float64
date              datetime64[ns]
dtype: object

In [13]:
df["date"] = pd.to_datetime(df['date'])
#hay que hace el clean up antes de poder manipular los datos para evitar que se de algun error de conversion

In [14]:
df.head()

,account number,name,sku,quantity,unit price,ext price,date
0,740150,Barton LLC,B1-20000,39,86.69,3380.91,2014-01-01 07:21:51
1,714466,Trantow-Barrows,S2-77896,-1,63.16,-63.16,2014-01-01 10:00:47
2,218895,Kulas Inc,B1-69924,23,90.70,2086.10,2014-01-01 13:24:58
3,307599,"Kassulke, Ondricka and Metz",S1-65481,41,21.05,863.05,2014-01-01 15:05:22
4,412290,Jerde-Hilpert,S2-34077,6,83.21,499.26,2014-01-01 23:26:55

In [25]:
df.set_index('date').resample('M')["ext price","unit price","quantity"].sum()
#si no existen datos en correspondientes se rellenan los campos con NaN, por lo que es importante hacer un tratamiento de los mismos.

            ext price  unit price  quantity
date
2014-01-31  185361.66     7297.38      3225
2014-02-28  146211.62     5975.99      2676
2014-03-31  203921.38     8480.77      3458
2014-04-30  174574.11     7198.02      3283
2014-05-31  165418.55     7463.65      3023
2014-06-30  174089.33     6974.31      3076
2014-07-31  191662.11     6927.02      3394
2014-08-31  153778.59     6387.84      2874
2014-09-30  168443.17     6279.76      3151
2014-10-31  171495.32     6984.69      2931
2014-11-30  119961.22     5768.14      2478
2014-12-31  163867.26     6773.72      2894

In [28]:
df.set_index('date').groupby('name')["ext price"].resample("M").sum()
#df.set_index('date').groupby('name')["ext price"].sum()

name                             date
Barton LLC                       2014-01-31     6177.57
                                 2014-02-28    12218.03
                                 2014-03-31     3513.53
                                 2014-04-30    11474.20
                                 2014-05-31    10220.17
                                 2014-06-30    10463.73
                                 2014-07-31     6750.48
                                 2014-08-31    17541.46
                                 2014-09-30    14053.61
                                 2014-10-31     9351.68
                                 2014-11-30     4901.14
                                 2014-12-31     2772.90
Cronin, Oberbrunner and Spencer  2014-01-31     1141.75
                                 2014-02-28    13976.26
                                 2014-03-31    11691.62
                                 2014-04-30     3685.44
                                 2014-05-31     6760.11
                                 2014-06-30     5379.67
                                 2014-07-31     6020.30
                                 2014-08-31     5399.58
                                 2014-09-30    12693.74
                                 2014-10-31     9324.37
                                 2014-11-30     6021.11
                                 2014-12-31     7640.60
Frami, Hills and Schmidt         2014-01-31     5112.34
                                 2014-02-28     4124.53
                                 2014-03-31    10397.44
                                 2014-04-30     5036.18
                                 2014-05-31     4097.87
                                 2014-06-30    13192.19
                                                 ...
Trantow-Barrows                  2014-07-31    11987.34
                                 2014-08-31    17251.65
                                 2014-09-30     6992.48
                                 2014-10-31    10064.27
                                 2014-11-30     6550.10
                                 2014-12-31    10124.23
White-Trantow                    2014-01-31    13703.77
                                 2014-02-28    11783.98
                                 2014-03-31     8583.05
                                 2014-04-30    19009.20
                                 2014-05-31     5877.29
                                 2014-06-30    14791.32
                                 2014-07-31    10242.62
                                 2014-08-31    12287.21
                                 2014-09-30     5315.16
                                 2014-10-31    19896.85
                                 2014-11-30     9544.61
                                 2014-12-31     4806.93
Will LLC                         2014-01-31    20953.87
                                 2014-02-28    13613.06
                                 2014-03-31     9838.93
                                 2014-04-30     6094.94
                                 2014-05-31    11856.95
                                 2014-06-30     2419.52
                                 2014-07-31    11017.54
                                 2014-08-31     1439.82
                                 2014-09-30     4345.99
                                 2014-10-31     7085.33
                                 2014-11-30     3210.44
                                 2014-12-31    12561.21
Name: ext price, Length: 240, dtype: float64

In [31]:
df.groupby(['name', pd.Grouper(key='date', freq='M')])['ext price'].sum()
#df.groupby(['name', pd.Grouper(key='date', freq='M')])['ext price'].sum().loc["Barton LLC"]
#el .loc es para consultar por un valor específico basado en el label de la columna

name                             date
Barton LLC                       2014-01-31     6177.57
                                 2014-02-28    12218.03
                                 2014-03-31     3513.53
                                 2014-04-30    11474.20
                                 2014-05-31    10220.17
                                 2014-06-30    10463.73
                                 2014-07-31     6750.48
                                 2014-08-31    17541.46
                                 2014-09-30    14053.61
                                 2014-10-31     9351.68
                                 2014-11-30     4901.14
                                 2014-12-31     2772.90
Cronin, Oberbrunner and Spencer  2014-01-31     1141.75
                                 2014-02-28    13976.26
                                 2014-03-31    11691.62
                                 2014-04-30     3685.44
                                 2014-05-31     6760.11
                                 2014-06-30     5379.67
                                 2014-07-31     6020.30
                                 2014-08-31     5399.58
                                 2014-09-30    12693.74
                                 2014-10-31     9324.37
                                 2014-11-30     6021.11
                                 2014-12-31     7640.60
Frami, Hills and Schmidt         2014-01-31     5112.34
                                 2014-02-28     4124.53
                                 2014-03-31    10397.44
                                 2014-04-30     5036.18
                                 2014-05-31     4097.87
                                 2014-06-30    13192.19
                                                 ...
Trantow-Barrows                  2014-07-31    11987.34
                                 2014-08-31    17251.65
                                 2014-09-30     6992.48
                                 2014-10-31    10064.27
                                 2014-11-30     6550.10
                                 2014-12-31    10124.23
White-Trantow                    2014-01-31    13703.77
                                 2014-02-28    11783.98
                                 2014-03-31     8583.05
                                 2014-04-30    19009.20
                                 2014-05-31     5877.29
                                 2014-06-30    14791.32
                                 2014-07-31    10242.62
                                 2014-08-31    12287.21
                                 2014-09-30     5315.16
                                 2014-10-31    19896.85
                                 2014-11-30     9544.61
                                 2014-12-31     4806.93
Will LLC                         2014-01-31    20953.87
                                 2014-02-28    13613.06
                                 2014-03-31     9838.93
                                 2014-04-30     6094.94
                                 2014-05-31    11856.95
                                 2014-06-30     2419.52
                                 2014-07-31    11017.54
                                 2014-08-31     1439.82
                                 2014-09-30     4345.99
                                 2014-10-31     7085.33
                                 2014-11-30     3210.44
                                 2014-12-31    12561.21
Name: ext price, Length: 240, dtype: float64

In [32]:
df.groupby(['name', pd.Grouper(key='date', freq='A-DEC')])['ext price'].sum()

name                             date
Barton LLC                       2014-12-31    109438.50
Cronin, Oberbrunner and Spencer  2014-12-31     89734.55
Frami, Hills and Schmidt         2014-12-31    103569.59
Fritsch, Russel and Anderson     2014-12-31    112214.71
Halvorson, Crona and Champlin    2014-12-31     70004.36
Herman LLC                       2014-12-31     82865.00
Jerde-Hilpert                    2014-12-31    112591.43
Kassulke, Ondricka and Metz      2014-12-31     86451.07
Keeling LLC                      2014-12-31    100934.30
Kiehn-Spinka                     2014-12-31     99608.77
Koepp Ltd                        2014-12-31    103660.54
Kuhn-Gusikowski                  2014-12-31     91094.28
Kulas Inc                        2014-12-31    137351.96
Pollich LLC                      2014-12-31     87347.18
Purdy-Kunde                      2014-12-31     77898.21
Sanford and Sons                 2014-12-31     98822.98
Stokes LLC                       2014-12-31     91535.92
Trantow-Barrows                  2014-12-31    123381.38
White-Trantow                    2014-12-31    135841.99
Will LLC                         2014-12-31    104437.60
Name: ext price, dtype: float64

In [33]:
df[["ext price", "quantity"]].sum()

ext price    2018784.32
quantity       36463.00
dtype: float64

In [34]:
df[["ext price", "quantity", "unit price"]].agg(['sum', 'mean'])

         ext price      quantity    unit price
sum   2.018784e+06  36463.000000  82511.290000
mean  1.345856e+03     24.308667     55.007527

In [35]:
df.agg({'ext price': ['sum', 'mean'], 'quantity': ['sum', 'mean'], 'unit price': ['mean']})

         ext price      quantity  unit price
mean  1.345856e+03     24.308667   55.007527
sum   2.018784e+06  36463.000000         NaN

In [46]:
get_max = lambda x: x.value_counts(dropna=False).index[0]
#en este ejemplo el value_counts asume que el valor mas frecuente se pone de primero y se accede a él por medio del indice 0, para casos donde se requiere saber cual es el valor menos frecuente se puede hacer un sort ascendiente del indice y tomar el valor 0 

#para cambiarle el nombre a la funcion lambda
get_max.__name__ = "most frequent"

In [47]:
df.agg({'ext price': ['sum', 'mean'], 'quantity': ['sum', 'mean'], 'unit price': ['mean'], 'sku': [get_max]})

                  ext price      quantity  unit price       sku
mean           1.345856e+03     24.308667   55.007527       NaN
most frequent           NaN           NaN         NaN  S2-77896
sum            2.018784e+06  36463.000000         NaN       NaN

In [48]:
import collections
f = collections.OrderedDict([('ext price', ['sum', 'mean']), ('quantity', ['sum', 'mean']), ('sku', [get_max])])
df.agg(f)

                  ext price      quantity       sku
mean           1.345856e+03     24.308667       NaN
most frequent           NaN           NaN  S2-77896
sum            2.018784e+06  36463.000000       NaN

In [65]:
#cual es el name que aparece mas veces
display(df["name"].value_counts(dropna=False).index[0])
display(df["name"].value_counts(dropna=False).index[1])

'Trantow-Barrows'

'Kulas Inc'

In [76]:
#2 Cual es el nombre que aparece mas veces
df.groupby('name')["date"].count().sort_values(ascending=False).iloc[0:2]

name
Kulas Inc          94
Trantow-Barrows    94
Name: date, dtype: int64

In [77]:
#3 cual nombre que tiene mas quantity
df.groupby('name')["quantity"].sum().sort_values(ascending=False).iloc[0:2]

name
Trantow-Barrows    2271
Kulas Inc          2265
Name: quantity, dtype: int64

In [85]:
#4 Existe una cuenta que tenga mas de un nombre asociado o viceversa
#df.groupby('name')["account number"].count().sort_values(ascending=False)
df.groupby(['name',"account number"])['ext price'].count()

name                             account number
Barton LLC                       740150            82
Cronin, Oberbrunner and Spencer  257198            67
Frami, Hills and Schmidt         786968            72
Fritsch, Russel and Anderson     737550            81
Halvorson, Crona and Champlin    604255            58
Herman LLC                       141962            62
Jerde-Hilpert                    412290            89
Kassulke, Ondricka and Metz      307599            64
Keeling LLC                      688981            74
Kiehn-Spinka                     146832            79
Koepp Ltd                        729833            82
Kuhn-Gusikowski                  672390            73
Kulas Inc                        218895            94
Pollich LLC                      642753            73
Purdy-Kunde                      163416            53
Sanford and Sons                 527099            71
Stokes LLC                       239344            72
Trantow-Barrows                  714466            94
White-Trantow                    424914            86
Will LLC                         383080            74
Name: ext price, dtype: int64

In [83]:
df.groupby(["account number", 'name'])['ext price'].count().sort_index(level=-1)

account number  name
740150          Barton LLC                         82
257198          Cronin, Oberbrunner and Spencer    67
786968          Frami, Hills and Schmidt           72
737550          Fritsch, Russel and Anderson       81
604255          Halvorson, Crona and Champlin      58
141962          Herman LLC                         62
412290          Jerde-Hilpert                      89
307599          Kassulke, Ondricka and Metz        64
688981          Keeling LLC                        74
146832          Kiehn-Spinka                       79
729833          Koepp Ltd                          82
672390          Kuhn-Gusikowski                    73
218895          Kulas Inc                          94
642753          Pollich LLC                        73
163416          Purdy-Kunde                        53
527099          Sanford and Sons                   71
239344          Stokes LLC                         72
714466          Trantow-Barrows                    94
424914          White-Trantow                      86
383080          Will LLC                           74
Name: ext price, dtype: int64

In [88]:
df.groupby('name')["account number"].nunique()

name
Barton LLC                         1
Cronin, Oberbrunner and Spencer    1
Frami, Hills and Schmidt           1
Fritsch, Russel and Anderson       1
Halvorson, Crona and Champlin      1
Herman LLC                         1
Jerde-Hilpert                      1
Kassulke, Ondricka and Metz        1
Keeling LLC                        1
Kiehn-Spinka                       1
Koepp Ltd                          1
Kuhn-Gusikowski                    1
Kulas Inc                          1
Pollich LLC                        1
Purdy-Kunde                        1
Sanford and Sons                   1
Stokes LLC                         1
Trantow-Barrows                    1
White-Trantow                      1
Will LLC                           1
Name: account number, dtype: int64